<h2 style='color:green' align="center"> Predicting the profits of 50 startups based on different variables </h2>

**Dataset** - (https://www.kaggle.com/farhanmd29/50-startups)

**About this file**

This dataset has data collected from New York, California and Florida about 50 business Startups "17 in each state". The variables used in the dataset are Profit, R&D spending, Administration Spending, and Marketing Spending.

In [1]:
import pandas as pd
df = pd.read_csv('50_startups.csv')
df.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

<h4 style='color:green'>Data Exploration </h4>

In [2]:
df.describe()

           R&D Spend  Administration  Marketing Spend         Profit
count      50.000000       50.000000        50.000000      50.000000
mean    73721.615600   121344.639600    211025.097800  112012.639200
std     45902.256482    28017.802755    122290.310726   40306.180338
min         0.000000    51283.140000         0.000000   14681.400000
25%     39936.370000   103730.875000    129300.132500   90138.902500
50%     73051.080000   122699.795000    212716.240000  107978.190000
75%    101602.800000   144842.180000    299469.085000  139765.977500
max    165349.200000   182645.560000    471784.100000  192261.830000

In [3]:
# looking for any NA value
df.isnull().sum()

R&D Spend          0
Administration     0
Marketing Spend    0
State              0
Profit             0
dtype: int64

In [4]:
# Converting the state column into numerical

dummies = pd.get_dummies(df.State)
dummies.head()

   California  Florida  New York
0           0        0         1
1           1        0         0
2           0        1         0
3           0        0         1
4           0        1         0

In [5]:
merged = pd.concat([df, dummies], axis = 'columns')
merged.head()

,R&D Spend,Administration,Marketing Spend,State,Profit,California,Florida,New York
0,165349.20,136897.80,471784.10,New York,192261.83,0,0,1
1,162597.70,151377.59,443898.53,California,191792.06,1,0,0
2,153441.51,101145.55,407934.54,Florida,191050.39,0,1,0
3,144372.41,118671.85,383199.62,New York,182901.99,0,0,1
4,142107.34,91391.77,366168.42,Florida,166187.94,0,1,0

In [6]:
# Dropping california because of dummy variable trap

df2 = merged.drop(['State', 'California'], axis = 'columns')
df2.head()

   R&D Spend  Administration  Marketing Spend     Profit  Florida  New York
0  165349.20       136897.80        471784.10  192261.83        0         1
1  162597.70       151377.59        443898.53  191792.06        0         0
2  153441.51       101145.55        407934.54  191050.39        1         0
3  144372.41       118671.85        383199.62  182901.99        0         1
4  142107.34        91391.77        366168.42  166187.94        1         0

<h4 style='color:green'>Model building</h4>

In [7]:
x = df2.drop(['Profit'], axis = 'columns')
y = df2['Profit']

In [8]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size = 0.2)

from sklearn.linear_model import LinearRegression
model = LinearRegression()
model.fit(x_train, y_train)

LinearRegression()

In [9]:
model.predict(x_test)

array([127497.82802039, 151604.92388489, 100530.84060345, 113971.25764284,
        98946.71302458, 127755.25772912,  73223.43876268,  84829.86268185,
       116916.96654585, 156448.02804399])

In [10]:
model.score(x_test, y_test)

0.8785555658128632

**From above its clear that model is good to go as prediction is 95.25% correct.**

In [12]:
x_test

    R&D Spend  Administration  Marketing Spend  Florida  New York
12   93863.75       127320.38        249839.44        1         0
8   120542.52       148718.95        311613.29        0         1
29   65605.48       153032.06        107138.38        0         1
19   86419.70       153514.11             0.00        0         1
32   63408.86       129219.61         46085.25        0         0
18   91749.16       114175.79        294919.57        1         0
36   28663.76       127056.21        201126.82        1         0
39   38558.51        82982.09        174999.30        0         0
21   78389.47       153773.43        299737.29        0         1
9   123334.88       108679.17        304981.62        0         0

In [14]:
model.predict(90000, 120000, 46000, 0,1,0]

TypeError: 'method' object is not subscriptable